Catalogs/ПроцессПодПрограммыТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПроцессПодПрограммыТермообработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПодПрограммыТермообработки</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцесса</Name>
					<Comment>весь процесс в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцессаЧасов</Name>
					<Comment>(час.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцессаМинут</Name>
					<Comment>(мин.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПроцессаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураВКамере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураВБатоне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПШ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Влажность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПроцессПодПрограммыТермообработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Модуль формы элемента ПроцессПодПрограммыТермообработки

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВнеКамеры();
КонецПроцедуры // ПриСозданииНаСервере // + claude

&НаСервере
Процедура ОбновитьВнеКамеры()
	Если ЗначениеЗаполнено(Объект.ВидПроцесса) И Объект.ВидПроцесса.ВнеКамеры Тогда
		Элементы.ВнеКамерыДекорация.Заголовок = "Вне камеры";
	Иначе
		Элементы.ВнеКамерыДекорация.Заголовок = "";
	КонецЕсли;
КонецПроцедуры // ОбновитьВнеКамеры // + claude

&НаКлиенте
Процедура ВидПроцессаПриИзменении(Элемент)
	ВидПроцессаПриИзменении_НаСервере();
КонецПроцедуры // ВидПроцессаПриИзменении // + claude

&НаСервере
Процедура ВидПроцессаПриИзменении_НаСервере()
	ОбновитьВнеКамеры();
КонецПроцедуры // ВидПроцессаПриИзменении_НаСервере // + claude

&НаКлиенте
Процедура РассчитатьДлинуПроцесса()
	// ДлинаПроцесса = сумма в минутах
	Объект.ДлинаПроцесса = Объект.ДлинаПроцессаДней * 1440
		+ Объект.ДлинаПроцессаЧасов * 60
		+ Объект.ДлинаПроцессаМинут;
КонецПроцедуры // РассчитатьДлинуПроцесса // + claude

&НаКлиенте
Процедура РазложитьДлинуПроцесса()
	// Разложение ДлинаПроцесса (в минутах) на дни/часы/минуты
	ОбщоМинут                 = Объект.ДлинаПроцесса;
	Объект.ДлинаПроцессаДней  = Цел(ОбщоМинут / 1440);
	ОстатокМинут              = ОбщоМинут - Цел(ОбщоМинут / 1440) * 1440;
	Объект.ДлинаПроцессаЧасов = Цел(ОстатокМинут / 60);
	Объект.ДлинаПроцессаМинут = ОстатокМинут - Цел(ОстатокМинут / 60) * 60;
КонецПроцедуры // РазложитьДлинуПроцесса // + claude

&НаКлиенте
Процедура ДлинаПроцессаЧасовПриИзменении(Элемент)
	РассчитатьДлинуПроцесса();
КонецПроцедуры // ДлинаПроцессаЧасовПриИзменении // + claude

&НаКлиенте
Процедура ДлинаПроцессаМинутПриИзменении(Элемент)
	РассчитатьДлинуПроцесса();
КонецПроцедуры // ДлинаПроцессаМинутПриИзменении // + claude

&НаКлиенте
Процедура ДлинаПроцессаДнейПриИзменении(Элемент)
	РассчитатьДлинуПроцесса();
КонецПроцедуры // ДлинаПроцессаДнейПриИзменении // + claude

&НаКлиенте
Процедура ДлинаПроцессаПриИзменении(Элемент)
	РазложитьДлинуПроцесса();
КонецПроцедуры // ДлинаПроцессаПриИзменении // + claude
